{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "front_conv_1x1_x1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "front_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "front_residual_x1_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "front_residual_x1_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "front_residual_x1_conv_1x1_x1/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "front_residual_x1_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "front_residual_x1_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "front_residual_x1_conv_3x3_x2/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "front_residual_x1_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "front_residual_x1_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "front_residual_x1_conv_1x1_x3/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "front_residual_x2_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "front_residual_x2_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "front_residual_x2_conv_1x1_x1/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "front_residual_x2_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "front_residual_x2_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "front_residual_x2_conv_3x3_x2/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "front_residual_x2_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "front_residual_x2_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "front_residual_x2_conv_1x1_x3/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "front_residual_x3_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "front_residual_x3_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "front_residual_x3_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "front_residual_x3_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "front_residual_x3_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "front_residual_x3_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "front_residual_x3_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "front_residual_x3_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "front_residual_x3_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "front_residual_x3skip/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "front_residual_x3skip/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "front_residual_x3skip/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_l1_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_l1_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_l1_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l1_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_l1_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_l1_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l1_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_l1_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_l1_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_l2_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_l2_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_l2_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l2_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_l2_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_l2_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l2_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_l2_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_l2_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_l4_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_l4_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_l4_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l4_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_l4_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_l4_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l4_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_l4_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_l4_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_l8_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_l8_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_l8_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_19/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l8_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_l8_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_l8_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_20/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_l8_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_l8_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_l8_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "0_lf8_x1_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "0_lf8_x1_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "0_lf8_x1_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_25/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_x1_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "0_lf8_x1_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "0_lf8_x1_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_x1_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "0_lf8_x1_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "0_lf8_x1_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_27/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "0_lf8_x2_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "0_lf8_x2_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "0_lf8_x2_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_28/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_28/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_28/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_28/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_x2_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "0_lf8_x2_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "0_lf8_x2_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_29/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_29/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_29/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_29/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_x2_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "0_lf8_x2_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "0_lf8_x2_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_30/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_30/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_30/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_30/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "0_lf8_x3_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "0_lf8_x3_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "0_lf8_x3_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "0_lf8_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "0_lf8_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_31/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_31/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_31/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_31/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_x3_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "0_lf8_x3_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "0_lf8_x3_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "0_lf8_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "0_lf8_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "0_lf8_x3_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "0_lf8_x3_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "0_lf8_x3_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "0_lf8_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "0_lf8_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "0_lf8_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_35/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_35/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_35/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_35/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_33/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_33/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_33/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_33/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_24/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_36/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_36/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_36/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_36/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_37/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_40/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_40/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_40/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_40/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_38/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_41/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_41/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_41/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_41/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_rf4_connect_conv_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_39/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_42/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_42/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_42/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_42/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_43/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_43/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_43/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_43/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_46/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_46/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_46/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_46/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_47/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_47/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_47/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_47/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_rf2_connect_conv_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_45/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_45/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_45/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_45/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_48/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_48/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_48/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_48/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_49/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_49/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_49/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_49/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_50/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_50/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_50/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_50/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg0_rf1_connect_conv_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_51/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_51/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_51/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_51/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "0_conv_1x1_x1/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "0_conv_1x1_x1/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_52/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_52/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_52/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_52/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "0_conv_1x1_parts/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "0_conv_1x1_parts/bias", "shape": [16], "dtype": "float32"}, {"name": "0_conv_1x1_x2/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "0_conv_1x1_x2/bias", "shape": [128], "dtype": "float32"}, {"name": "0_conv_1x1_x3/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "0_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "hg1_l1_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_l1_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_l1_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_53/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_53/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_53/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_53/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l1_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg1_l1_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg1_l1_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_54/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_54/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_54/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_54/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l1_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg1_l1_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg1_l1_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_55/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_55/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_55/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_55/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg1_l2_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_l2_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_l2_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_56/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_56/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_56/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_56/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l2_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg1_l2_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg1_l2_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_57/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_57/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_57/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_57/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l2_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg1_l2_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg1_l2_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_58/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_58/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_58/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_58/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg1_l4_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_l4_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_l4_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_59/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_59/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_59/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_59/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l4_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg1_l4_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg1_l4_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_60/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_60/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_60/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_60/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l4_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg1_l4_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg1_l4_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_61/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_61/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_61/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_61/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg1_l8_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_l8_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_l8_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_62/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_62/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_62/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_62/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l8_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg1_l8_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg1_l8_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_63/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_63/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_63/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_63/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_l8_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg1_l8_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg1_l8_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_64/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_64/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_64/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_64/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "1_lf8_x1_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "1_lf8_x1_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "1_lf8_x1_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_68/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_68/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_68/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_68/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_x1_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "1_lf8_x1_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "1_lf8_x1_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_69/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_69/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_69/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_69/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_x1_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "1_lf8_x1_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "1_lf8_x1_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_70/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_70/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_70/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_70/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "1_lf8_x2_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "1_lf8_x2_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "1_lf8_x2_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_71/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_71/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_71/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_71/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_x2_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "1_lf8_x2_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "1_lf8_x2_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_72/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_72/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_72/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_72/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_x2_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "1_lf8_x2_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "1_lf8_x2_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_73/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_73/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_73/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_73/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "1_lf8_x3_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "1_lf8_x3_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "1_lf8_x3_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "1_lf8_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "1_lf8_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_74/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_74/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_74/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_74/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_x3_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "1_lf8_x3_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "1_lf8_x3_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "1_lf8_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "1_lf8_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_77/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_77/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_77/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_77/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_75/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_75/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_75/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_75/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_66/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_66/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_66/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_66/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_3x3_x2/bias", "shape": [64], "dtype": "float32"}, {"name": "1_lf8_x3_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "1_lf8_x3_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "1_lf8_x3_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "1_lf8_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "1_lf8_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "1_lf8_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_78/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_78/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_78/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_78/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_76/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_76/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_76/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_76/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_1x1_x3/depthwise_kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_1x1_x3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_1x1_x3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_79/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_79/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_79/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_79/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "hg1_rf2_connect_conv_1x1_x1/depthwise_kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "hg1_rf2_connect_conv_1x1_x1/pointwise_kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hg1_rf2_connect_conv_1x1_x1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_80/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_80/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_80/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_80/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_83/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_83/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_83/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_83/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_conv_3x3_x2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_conv_3x3_x2/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hg1_rf4_connect_conv_conv_3x3_x2/bias", "shape": 